Locked-Inc/STAR/star-rx72n-firmware/libs/rx_core/src/rx_iwdt.c
/**
 * @file rx_iwdt.c
 * @brief Independent Watchdog Timer (IWDT) Implementation for RX72N
 *
 * @details
 * Implements the hardware-independent watchdog timer driver with enhanced
 * task monitoring capabilities. The IWDT uses a dedicated 125 kHz clock
 * source, providing reliable watchdog functionality even during main clock
 * failures - a critical safety feature for robotics applications.
 *
 * ## Implementation Architecture
 *
 * @dot
 * digraph iwdt_implementation {
 *   rankdir=TB;
 *   node [shape=box, style=rounded];
 *   edge [fontsize=10];
 *
 *   subgraph cluster_state {
 *     label="Module State (s_iwdt_state)";
 *     style=dashed;
 *     config [label="config\nrx_iwdt_config_t"];
 *     tasks [label="tasks[8]\nrx_iwdt_task_info_t"];
 *     status [label="status\nrx_iwdt_status_t"];
 *     curr_state [label="current_state\nsystem_state_t"];
 *     initialized [label="initialized\nbool"];
 *   }
 *
 *   subgraph cluster_api {
 *     label="Public API";
 *     style=filled;
 *     fillcolor=lightblue;
 *     init [label="rx_iwdt_init()"];
 *     feed [label="rx_iwdt_feed()"];
 *     reg_task [label="rx_iwdt_register_task()"];
 *     heartbeat [label="rx_iwdt_task_heartbeat()"];
 *     set_state [label="rx_iwdt_set_state()"];
 *     check [label="rx_iwdt_check_tasks()"];
 *     get_status [label="rx_iwdt_get_status()"];
 *     was_reset [label="rx_iwdt_was_reset()"];
 *   }
 *
 *   subgraph cluster_internal {
 *     label="Internal Helpers";
 *     style=filled;
 *     fillcolor=lightyellow;
 *     get_tick [label="internal_get_tick_count()"];
 *     find_task [label="internal_find_task()"];
 *     find_slot [label="internal_find_free_slot()"];
 *     init_config [label="internal_init_default_config()"];
 *   }
 *
 *   subgraph cluster_hw {
 *     label="Hardware Registers";
 *     style=filled;
 *     fillcolor=lightgray;
 *     iwdtrr [label="IWDTRR\n0x00088030\n(Refresh Register)"];
 *     iwdtsr [label="IWDTSR\n0x00088032\n(Status Register)"];
 *     rstsr2 [label="RSTSR2\n(Reset Status 2)"];
 *   }
 *
 *   init -> config [label="store"];
 *   init -> init_config [label="if nullptr", style=dashed];
 *   init -> iwdtrr [label="initial feed"];
 *   init -> rstsr2 [label="check reset", style=dashed];
 *
 *   feed -> iwdtrr [label="write 0x00, 0xFF"];
 *   feed -> status [label="increment feeds"];
 *
 *   reg_task -> find_slot;
 *   reg_task -> tasks [label="add"];
 *
 *   heartbeat -> find_task;
 *   heartbeat -> tasks [label="update tick"];
 *
 *   check -> tasks [label="scan all"];
 *   check -> get_tick;
 * }
 * @enddot
 *
 * ## IWDT vs WDT Comparison
 *
 * | Feature | IWDT (This Module) | WDT (rx_wdt.c) |
 * |---------|-------------------|----------------|
 * | Clock Source | IWDTCLK (125 kHz independent) | PCLKB (system clock) |
 * | Can be Stopped | [X] No (hardware safety) | [OK] Yes |
 * | Clock Fault Detection | [OK] Yes (independent clock) | [X] No |
 * | Timeout Range | ~8 ms to ~17 seconds | ~4 us to ~273 us |
 * | Register Base | 0x00088030 | 0x00088020 |
 * | Task Monitoring | [OK] Software layer | [X] Not implemented |
 * | Primary Use | Production safety | Development/debugging |
 *
 * ## Task Monitoring System
 *
 * @msc
 * App, IWDT, Task1, Task2, HW;
 *
 * --- [label="Initialization"];
 * App => IWDT [label="rx_iwdt_init()"];
 * IWDT => HW [label="Initial feed"];
 *
 * --- [label="Task Registration"];
 * Task1 => IWDT [label="rx_iwdt_register_task(\"motor\", 500)"];
 * Task2 => IWDT [label="rx_iwdt_register_task(\"comm\", 1000)"];
 *
 * --- [label="Normal Operation"];
 * Task1 => IWDT [label="rx_iwdt_task_heartbeat(\"motor\")"];
 * IWDT box IWDT [label="Update last_heartbeat_tick"];
 * Task2 => IWDT [label="rx_iwdt_task_heartbeat(\"comm\")"];
 *
 * --- [label="Check & Feed Loop"];
 * App => IWDT [label="rx_iwdt_check_tasks()"];
 * IWDT box IWDT [label="Compare ticks vs timeout"];
 * App => IWDT [label="rx_iwdt_feed()"];
 * IWDT => HW [label="Write 0x00, 0xFF"];
 *
 * --- [label="Task Timeout"];
 * IWDT box IWDT [label="Task1 missed deadline"];
 * App => IWDT [label="rx_iwdt_check_tasks()"];
 * IWDT >> App [label="k_rx_err_timeout"];
 * @endmsc
 *
 * ## Memory Layout
 *
 * | Offset | Size | Field | Description |
 * |--------|------|-------|-------------|
 * | 0x000 | 68 | config | Configuration (timeouts, flags) |
 * | 0x044 | 320 | tasks[8] | Task info array (40 bytes each) |
 * | 0x184 | 76 | status | Status info |
 * | 0x1D0 | 1 | current_state | System state enum |
 * | 0x1D1 | 1 | initialized | Init flag |
 * | 0x1D2 | 2 | (padding) | Alignment |
 * | **Total** | **~470 bytes** | | Static allocation |
 *
 * ## Performance Characteristics
 *
 * | Function | Execution Time | Stack | Notes |
 * |----------|---------------|-------|-------|
 * | rx_iwdt_init() | ~30 us | 64 B | Memset + config copy |
 * | rx_iwdt_feed() | ~1 us | 8 B | 2 register writes |
 * | rx_iwdt_register_task() | ~10 us | 32 B | String copy + slot search |
 * | rx_iwdt_task_heartbeat() | ~5 us | 16 B | Task lookup + tick update |
 * | rx_iwdt_check_tasks() | ~20 us | 24 B | Scan all 8 tasks |
 *
 * @par Module Dependencies:
 * - [rx_iwdt.h](../inc/rx_iwdt.h) - Public API declarations
 * - [rx72n_iwdt_regs.h](../../rx_hal/inc/rx72n_iwdt_regs.h) - IWDT registers
 * - [rx72n_system_regs.h](../../rx_hal/inc/rx72n_system_regs.h) - System registers
 * - [rx_check.h](../inc/rx_check.h) - Validation macros
 * - `<tx_api.h>` - ThreadX API for tick count
 * - `<string.h>` - strlen, strcmp
 *
 * @par NASA Power of 10 Compliance:
 * - **Rule 1**: [OK] No goto, setjmp, recursion
 * - **Rule 2**: [OK] All loops bounded by k_iwdt_max_tasks
 * - **Rule 3**: [OK] Zero dynamic allocation (static state)
 * - **Rule 4**: [OK] All functions <60 lines
 * - **Rule 5**: [OK] Minimum 2 checks per function
 * - **Rule 6**: [OK] Data declared at smallest scope
 * - **Rule 7**: [OK] All return values checked or propagated
 * - **Rule 8**: [OK] C23 typed enums for constants
 * - **Rule 9**: [OK] Minimal pointer use, no pointer arithmetic
 * - **Rule 10**: [OK] Compiled with -Wall -Wextra -Werror
 *
 * @par SOLID Principles:
 * - **Single Responsibility**: Only IWDT and task monitoring
 * - **Open/Closed**: Extensible via configuration and state callbacks
 * - **Liskov Substitution**: Consistent rx_err_t return interface
 * - **Interface Segregation**: Separate init/feed/task/status APIs
 * - **Dependency Inversion**: Depends on abstract rx_err_t
 *
 * @see rx_iwdt.h Public API documentation and usage examples
 * @see rx_wdt.c Software-controllable watchdog (complementary)
 * @see RX72N User's Manual Section 11: Independent Watchdog Timer
 *
 * @author Locked, Inc.
 * @date 2026-01-28
 * @version 1.0.0
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 *
 * @since Version 1.0.0
 */

#include "rx_iwdt.h"

#include <string.h>

#ifdef UNIT_TEST
#include "mock_rx72n_iwdt_regs.h"
#include "mock_rx72n_system_regs.h"
#else
#include "rx72n_iwdt_regs.h"
#include "rx72n_system_regs.h"
#endif
#include "rx_check.h"
#include "tx_api.h" /* ThreadX API for tx_time_get() and TX_TIMER_TICKS_PER_SECOND */

