Locked-Inc/STAR/star-rx72n-firmware/libs/rx_core/src/rx_iwdt.c
/* =============================================================================
 * Static Data
 * =============================================================================
 */

/**
 * @struct rx_iwdt_state_t
 * @brief Internal state structure for IWDT driver
 *
 * @details
 * Aggregates all state for the IWDT driver including configuration,
 * task monitoring arrays, status tracking, and initialization flags.
 * This is the largest static allocation in the core library.
 *
 * @par Memory Layout:
 * | Offset | Size | Field | Description |
 * |--------|------|-------|-------------|
 * | 0x000 | ~68 | config | Configuration structure |
 * | 0x044 | 320 | tasks | 8 task info structures (40 B each) |
 * | 0x184 | ~76 | status | Status and counters |
 * | 0x1D0 | 1 | current_state | System state enum |
 * | 0x1D1 | 1 | initialized | Init complete flag |
 * | **Total** | **~470 bytes** | | Static allocation |
 *
 * @par State Transitions:
 * - initialized: false -> true on rx_iwdt_init() success
 * - current_state: k_system_state_init -> other states via rx_iwdt_set_state()
 * - tasks[n].active: false -> true via rx_iwdt_register_task()
 *
 * @invariant initialized implies config is valid
 * @invariant status.active_tasks equals count of tasks[].active==true
 *
 * @see s_iwdt_state Static instance
 *
 * @since Version 1.0.0
 */
typedef struct {
  rx_iwdt_config_t    config;                  /**< Configuration from rx_iwdt_init(). Contains
                                                    default timeout, task monitoring enable flag,
                                                    reset mode, and per-state timeout array. */
  rx_iwdt_task_info_t tasks[k_iwdt_max_tasks]; /**< Array of registered task info. Each entry
                                                    contains task name, timeout, last heartbeat
                                                    tick, and timeout flag. Max 8 tasks. */
  rx_iwdt_status_t    status;                  /**< Runtime status: feed count, reset count,
                                                    current state, active task count, last
                                                    failed task name. */
  system_state_t      current_state;           /**< Current system state for state-dependent
                                                    timeout selection. One of system_state_t. */
  bool                initialized;             /**< Module initialization flag. true = ready
                                                    for use, false = must call rx_iwdt_init(). */
} rx_iwdt_state_t;

/**
 * @var s_iwdt_state
 * @brief Global IWDT driver state
 *
 * @details
 * Single instance of IWDT state, zero-initialized at startup. All fields
 * start at 0/false/empty representing uninitialized state.
 *
 * **Memory Location:** .bss section (zero-initialized static data)
 * **Size:** ~470 bytes
 * **Alignment:** 4-byte aligned
 *
 * @par Access Pattern:
 * - **Write:** rx_iwdt_init(), rx_iwdt_register_task(), rx_iwdt_task_heartbeat(),
 *              rx_iwdt_set_state(), rx_iwdt_set_timeout_for_state(), rx_iwdt_feed(),
 *              rx_iwdt_check_tasks()
 * - **Read:** All functions (state checks)
 *
 * @note Not thread-safe for concurrent writes. Use external synchronization
 *       if calling from multiple threads.
 *
 * @see rx_iwdt_state_t Structure definition
 *
 * @since Version 1.0.0
 */
static rx_iwdt_state_t s_iwdt_state = {};

/* =============================================================================
 * Test Support Functions
 * =============================================================================
 */

#ifdef UNIT_TEST
/**
 * @brief Reset IWDT driver state for unit testing
 * @details
 * Resets the driver to uninitialized state. This function is only available
 * when UNIT_TEST is defined and should only be called from test code.
 */
void rx_iwdt_test_reset(void)
{
  s_iwdt_state = (rx_iwdt_state_t){};
}
#endif

/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 */

/**
 * @brief Copy a string with bounded length (replaces strncpy)
 *
 * @details
 * Copies up to max_len-1 characters from src to dst and null-terminates.
 * Avoids clang-tidy insecureAPI.DeprecatedOrUnsafeBufferHandling warnings
 * that strncpy triggers.
 *
 * @param[out] dst Destination buffer
 * @param[in] src Source string
 * @param[in] max_len Size of destination buffer (including null terminator)
 *
 * @pre dst != nullptr
 * @pre src != nullptr
 * @pre max_len > 0
 * @post dst is null-terminated
 *
 * @note Not thread-safe
 *
 * @since Version 1.0.0
 */
static void internal_safe_strcpy(char* dst, const char* src, size_t max_len)
{
  size_t i = 0;
  for (; i < max_len - 1U && src[i] != '\0'; i++) {
    dst[i] = src[i];
  }
  dst[i] = '\0';
}

/**
 * @brief Get current system tick count from ThreadX
 *
 * @details
 * Wrapper around ThreadX tx_time_get() to get the current tick count.
 * Used for task heartbeat timing calculations.
 *
 * **Algorithm:**
 * 1. Call tx_time_get() to get ThreadX tick count
 * 2. Cast ULONG to uint32_t for consistent type
 * 3. Return tick count
 *
 * @return uint32_t Current tick count from ThreadX timer
 *
 * @note ThreadX tick rate defined by TX_TIMER_TICKS_PER_SECOND
 * @note Tick count wraps at UINT32_MAX (~49.7 days at 1 kHz tick rate)
 * @note Thread-safe - tx_time_get() is reentrant
 *
 * @see tx_time_get() ThreadX API
 * @see TX_TIMER_TICKS_PER_SECOND Tick rate configuration
 *
 * @since Version 1.0.0
 */
static uint32_t internal_get_tick_count(void)
{
  return (uint32_t)tx_time_get();
}

/**
 * @brief Find registered task by name
 *
 * @details
 * Searches the task array for a task with matching name that is currently
 * active. Uses strcmp() for exact string comparison.
 *
 * **Algorithm:**
 * 1. Iterate through tasks[0..k_iwdt_max_tasks-1]
 * 2. For each entry: check if active AND name matches
 * 3. Return pointer to matching entry, or nullptr if not found
 *
 * @param[in] task_name Task name to search for (null-terminated string)
 *
 * @return rx_iwdt_task_info_t* Pointer to task info if found
 * @retval NULL Task not found or not active
 *
 * @pre task_name must be non-NULL (caller validates)
 *
 * @note Linear search O(n) where n = k_iwdt_max_tasks (8)
 * @note String comparison is case-sensitive
 *
 * @see rx_iwdt_register_task() Adds tasks to array
 * @see rx_iwdt_task_heartbeat() Uses this to find task
 *
 * @since Version 1.0.0
 */
static rx_iwdt_task_info_t* internal_find_task(const char* task_name)
{
  for (uint32_t i = 0; i < k_iwdt_max_tasks; i++) {
    if ((int)s_iwdt_state.tasks[i].active &&
        strcmp(s_iwdt_state.tasks[i].task_name, task_name) == 0) {
      return &s_iwdt_state.tasks[i];
    }
  }

  return nullptr;
}

/**
 * @brief Find free slot in task array
 *
 * @details
 * Searches for the first inactive slot in the task array where a new
 * task can be registered.
 *
 * **Algorithm:**
 * 1. Iterate through tasks[0..k_iwdt_max_tasks-1]
 * 2. For each entry: check if NOT active
 * 3. Return pointer to first inactive slot, or nullptr if all full
 *
 * @return rx_iwdt_task_info_t* Pointer to free slot if available
 * @retval NULL No free slots (all 8 tasks registered)
 *
 * @note Linear search O(n) where n = k_iwdt_max_tasks (8)
 * @note Returns first available slot (lowest index)
 *
 * @see rx_iwdt_register_task() Uses this to allocate slot
 * @see k_iwdt_max_tasks Maximum number of tasks (8)
 *
 * @since Version 1.0.0
 */
static rx_iwdt_task_info_t* internal_find_free_slot(void)
{
  for (uint32_t i = 0; i < k_iwdt_max_tasks; i++) {
    if (!s_iwdt_state.tasks[i].active) {
      return &s_iwdt_state.tasks[i];
    }
  }

  return nullptr;
}

/**
 * @brief Initialize default configuration structure
 *
 * @details
 * Populates a configuration structure with safe default values suitable
 * for most applications. Called when rx_iwdt_init() receives nullptr config.
 *
 * **Default Values:**
 * - default_timeout_ms = k_iwdt_default_timeout_ms (1000 ms)
 * - enable_task_monitoring = true
 * - reset_on_timeout = true
 * - All state_timeouts_ms[] = k_iwdt_default_timeout_ms
 *
 * **Algorithm:**
 * 1. Set default_timeout_ms to 1000 ms
 * 2. Enable task monitoring
 * 3. Enable reset on timeout
 * 4. Initialize all state timeouts to default value
 *
 * @param[out] config Configuration structure to initialize
 *
 * @pre config must be non-NULL (caller validates)
 *
 * @post config contains default values ready for use
 *
 * @note Loop bounded by k_system_state_count (NASA Rule 2)
 *
 * @see rx_iwdt_init() Calls this when config is nullptr
 * @see k_iwdt_default_timeout_ms Default timeout constant
 * @see k_system_state_count Number of system states
 *
 * @since Version 1.0.0
 */
static void internal_init_default_config(rx_iwdt_config_t* config)
{
  config->default_timeout_ms     = k_iwdt_default_timeout_ms;
  config->enable_task_monitoring = true;
  config->reset_on_timeout       = true;

  /* Initialize all state timeouts to default */
  for (uint32_t i = 0; i < k_system_state_count; i++) {
    config->state_timeouts_ms[i] = k_iwdt_default_timeout_ms;
  }
}

