Locked-Inc/STAR/star-rx72n-firmware/libs/rx_core/src/rx_iwdt.c
/* =============================================================================
 * Public API Implementation
 * =============================================================================
 */

/**
 * @brief Initialize IWDT driver with configuration and task monitoring
 *
 * @details
 * Initializes the IWDT driver, validates configuration, checks for previous
 * watchdog reset, and performs initial hardware feed. If config is nullptr,
 * uses safe default values (1000ms timeout, task monitoring enabled).
 *
 * **Algorithm:**
 * 1. Check if already initialized (return error if so)
 * 2. If config is nullptr, create default configuration
 * 3. Validate timeout within [k_iwdt_min_timeout_ms, k_iwdt_max_timeout_ms]
 * 4. Clear and initialize all state
 * 5. Check RSTSR2 for previous watchdog reset
 * 6. Perform initial feed to IWDTRR (0x00 then 0xFF)
 * 7. Set initialized flag
 *
 * @par OFS Configuration Note:
 * The IWDT hardware timeout is configured at flash-time via OFS (Option
 * Function Select) registers and cannot be changed at runtime. The timeout
 * values in this driver are used for software task monitoring only. The
 * hardware IWDT will timeout based on OFS settings regardless of software
 * configuration.
 *
 * @param[in] config Configuration pointer, or nullptr for defaults
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success
 * @retval k_rx_err_invalid_state Already initialized
 * @retval k_rx_err_invalid_arg Timeout out of valid range
 *
 * @pre IWDT not already initialized
 *
 * @post IWDT driver ready for use
 * @post Initial feed performed
 * @post Reset status captured
 *
 * @note Hardware timeout set by OFS, not this driver
 * @note nullptr config uses safe defaults (1000ms, monitoring enabled)
 *
 * @since Version 1.0.0
 */
rx_err_t rx_iwdt_init(const rx_iwdt_config_t* config)
{
  /* Check if already initialized */
  if (s_iwdt_state.initialized) {
    return k_rx_err_invalid_state;
  }

  /* Use default config if none provided */
  rx_iwdt_config_t local_config;
  if (config == nullptr) {
    internal_init_default_config(&local_config);
    config = &local_config;
  }

  /* Validate configuration */
  if (config->default_timeout_ms < k_iwdt_min_timeout_ms ||
      config->default_timeout_ms > k_iwdt_max_timeout_ms) {
    return k_rx_err_invalid_arg;
  }

  /* Initialize state */
  s_iwdt_state = (rx_iwdt_state_t){};
  {
    const uint8_t* src = (const uint8_t*)config;
    uint8_t*       dst = (uint8_t*)&s_iwdt_state.config;
    for (size_t byte_i = 0; byte_i < sizeof(rx_iwdt_config_t); byte_i++) {
      dst[byte_i] = src[byte_i];
    }
  }
  s_iwdt_state.current_state = k_system_state_init;

  /* Initialize status */
  s_iwdt_state.status.initialized        = true;
  s_iwdt_state.status.current_state      = k_system_state_init;
  s_iwdt_state.status.current_timeout_ms = config->default_timeout_ms;
  s_iwdt_state.status.active_tasks       = 0;

  /* Check if last reset was watchdog */
  if (rx_iwdt_was_reset()) {
    s_iwdt_state.status.total_resets++;
    s_iwdt_state.status.last_reset_reason = k_iwdt_reset_watchdog;
  } else {
    s_iwdt_state.status.last_reset_reason = k_iwdt_reset_power_on;
  }

  /* Note: IWDT hardware is configured via OFS (Option Function Select) registers
   * at compile/flash time and starts automatically on reset. We cannot reconfigure
   * the timeout period at runtime. This driver manages the software state and
   * provides the feed mechanism. The requested timeout is used for software task
   * monitoring only. */
  volatile rx_iwdt_regs_t* const regs = iwdt();

  /* Feed the watchdog to establish baseline */
  regs->iwdtrr = k_iwdt_refresh_start;
  regs->iwdtrr = k_iwdt_refresh_end;

  s_iwdt_state.initialized = true;

  return k_rx_ok;
}

/**
 * @brief Feed the independent watchdog timer to prevent system reset
 *
 * @details
 * Writes the two-byte refresh sequence (0x00 then 0xFF) to the IWDT Refresh
 * Register (IWDTRR) to reset the hardware watchdog counter. This must be
 * called periodically within the configured hardware timeout window or the
 * IWDT will reset the microcontroller.
 *
 * Per the RX72N hardware manual the refresh sequence is strictly ordered:
 * writing 0x00 to IWDTRR starts the window; writing 0xFF completes the
 * refresh. The entire sequence must occur within the permitted refresh window.
 *
 * Also increments the software diagnostic counter s_iwdt_state.status.watchdog_feeds
 * for telemetry and debugging purposes.
 *
 * Algorithm steps:
 * 1. Check s_iwdt_state.initialized; return k_rx_err_not_initialized if false
 * 2. Write k_iwdt_refresh_start (0x00) to regs->iwdtrr
 * 3. Write k_iwdt_refresh_end   (0xFF) to regs->iwdtrr
 * 4. Increment status.watchdog_feeds counter
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Watchdog counter successfully refreshed
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre Must be called within the hardware IWDT refresh window (no gap > configured timeout)
 * @post Hardware IWDT counter is reset; timeout window restarts
 * @post s_iwdt_state.status.watchdog_feeds is incremented by one
 *
 * @note Not thread-safe; concurrent feeds from multiple tasks are benign for
 *       the hardware but may produce incorrect feed counts
 * @warning Failing to call within the hardware timeout triggers a system reset
 *
 * @par Performance:
 * Execution time: <1 us @ 240 MHz; safe to call from any task or ISR context
 *
 * @par Example:
 * @code
 * // In main watchdog task loop
 * while (1) {
 *     rx_err_t err = rx_iwdt_feed();
 *     if (err != k_rx_ok) {
 *         rx_log_error("wdt", "IWDT not initialized");
 *     }
 *     tx_thread_sleep(k_watchdog_feed_interval_ticks);
 * }
 * @endcode
 *
 * @see rx_iwdt_init() Initialize IWDT before feeding
 * @see rx_iwdt_check_tasks() Verify all tasks are alive before feeding
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 1 precondition (initialized check), 2 postconditions (HW reset, counter++)
 */
rx_err_t rx_iwdt_feed(void)
{
  volatile rx_iwdt_regs_t* regs;

  /* Check initialization */
  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  /* Refresh watchdog counter - write 0x00 then 0xFF to IWDTRR */
  regs         = iwdt();
  regs->iwdtrr = k_iwdt_refresh_start;
  regs->iwdtrr = k_iwdt_refresh_end;

  s_iwdt_state.status.watchdog_feeds++;

