Locked-Inc/STAR/star-rx72n-firmware/libs/rx_core/src/rx_iwdt.c
  return k_rx_ok;
}

/**
 * @brief Register a ThreadX task for software watchdog monitoring
 *
 * @details
 * Adds a task entry to the IWDT software monitoring table, associating the
 * task name with a per-task timeout. Once registered, the task must call
 * rx_iwdt_task_heartbeat() at least once per timeout_ms milliseconds or
 * rx_iwdt_check_tasks() will report k_rx_err_timeout.
 *
 * The registration also records the current tick count as the initial
 * last_heartbeat_tick, giving the task a full timeout_ms window before
 * the first heartbeat is required.
 *
 * Algorithm steps:
 * 1. Validate task_name is non-null
 * 2. Verify s_iwdt_state.initialized
 * 3. Validate timeout_ms is in [k_iwdt_min_timeout_ms, k_iwdt_max_timeout_ms]
 * 4. Check task name length is in (0, k_iwdt_task_name_len)
 * 5. Check task is not already registered via internal_find_task()
 * 6. Find a free slot via internal_find_free_slot()
 * 7. Initialize slot with task name, timeout, current tick, active=true, timed_out=false
 * 8. Increment status.active_tasks
 *
 * @param[in] task_name Unique task identifier string (non-empty, max k_iwdt_task_name_len-1 chars,
 *            null-terminated); must remain valid for the lifetime of registration
 * @param[in] timeout_ms Per-task heartbeat timeout in milliseconds;
 *            valid range [k_iwdt_min_timeout_ms(100), k_iwdt_max_timeout_ms(60000)]
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Task successfully registered
 * @retval k_rx_err_null_ptr task_name is nullptr
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 * @retval k_rx_err_invalid_arg timeout_ms out of range, name empty, name too long,
 *         or task already registered
 * @retval k_rx_err_no_mem No free task slots (maximum k_iwdt_max_tasks tasks)
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre task_name must be unique among registered tasks
 * @post Task entry is active in s_iwdt_state.tasks[]
 * @post status.active_tasks is incremented by one
 *
 * @note Not thread-safe; serialize registrations from multiple contexts
 *
 * @par Example:
 * @code
 * rx_err_t err = rx_iwdt_register_task("motor_ctrl", 500);
 * if (err != k_rx_ok) {
 *     rx_log_error("wdt", "Failed to register motor_ctrl task");
 * }
 * @endcode
 *
 * @see rx_iwdt_task_heartbeat() Update heartbeat for a registered task
 * @see rx_iwdt_check_tasks() Check all registered tasks for timeout
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 5 preconditions (null, initialized, timeout, name, duplicate), 2 postconditions
 */
rx_err_t rx_iwdt_register_task(const char* task_name, uint32_t timeout_ms)
{
  /* Validate inputs */
  if (task_name == nullptr) {
    return k_rx_err_null_ptr;
  }

  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  if (timeout_ms < k_iwdt_min_timeout_ms || timeout_ms > k_iwdt_max_timeout_ms) {
    return k_rx_err_invalid_arg;
  }

  /* Check task name length */
  const uint32_t name_len = (uint32_t)strlen(task_name);
  if (name_len == 0 || name_len >= k_iwdt_task_name_len) {
    return k_rx_err_invalid_arg;
  }

  /* Check if task already registered */
  if (internal_find_task(task_name) != nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Find free slot */
  rx_iwdt_task_info_t* const slot = internal_find_free_slot();
  if (slot == nullptr) {
    return k_rx_err_no_mem;
  }

  /* Register task */
  *slot = (rx_iwdt_task_info_t){};
  internal_safe_strcpy(slot->task_name, task_name, k_iwdt_task_name_len);
  slot->timeout_ms          = timeout_ms;
  slot->last_heartbeat_tick = internal_get_tick_count();
  slot->active              = true;
  slot->timed_out           = false;

  s_iwdt_state.status.active_tasks++;

  return k_rx_ok;
}

/**
 * @brief Send a heartbeat signal for a registered task to reset its timeout
 *
 * @details
 * Updates the last_heartbeat_tick for the named task to the current ThreadX
 * tick count, resetting the timeout window. Also clears the timed_out flag
 * if the task had previously been marked as timed out.
 *
 * Tasks must call this function at least once per their registered timeout_ms
 * window (configured in rx_iwdt_register_task()) to remain in good standing.
 * If the interval between heartbeats exceeds timeout_ms, the next call to
 * rx_iwdt_check_tasks() will return k_rx_err_timeout.
 *
 * Algorithm steps:
 * 1. Validate task_name is non-null
 * 2. Verify s_iwdt_state.initialized
 * 3. Find the task entry via internal_find_task()
 * 4. Set task->last_heartbeat_tick = internal_get_tick_count()
 * 5. Clear task->timed_out
 *
 * @param[in] task_name Null-terminated name of the registered task sending heartbeat;
 *            must exactly match the name used in rx_iwdt_register_task()
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Heartbeat timestamp updated and timed_out flag cleared
 * @retval k_rx_err_null_ptr task_name is nullptr
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 * @retval k_rx_err_not_found No task registered with the given name
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre Task must have been registered via rx_iwdt_register_task()
 * @post task->last_heartbeat_tick is refreshed to the current tick count
 * @post task->timed_out is false
 *
 * @note Not thread-safe; concurrent heartbeats from different tasks are safe
 *       as they write to distinct slots, but concurrent writes to the same slot are not
 *
 * @par Example:
 * @code
 * // At top of motor control task loop
 * while (1) {
 *     rx_iwdt_task_heartbeat("motor_ctrl");
 *     motor_control_update();
 *     tx_thread_sleep(k_motor_ctrl_period_ticks);
 * }
 * @endcode
 *
 * @see rx_iwdt_register_task() Register a task before sending heartbeats
 * @see rx_iwdt_check_tasks() Verify all tasks are within their timeout windows
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 3 preconditions (null, initialized, registered), 2 postconditions
 */
rx_err_t rx_iwdt_task_heartbeat(const char* task_name)
{
  /* Validate inputs */
  if (task_name == nullptr) {
    return k_rx_err_null_ptr;
  }

  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  /* Find task */
  rx_iwdt_task_info_t* const task = internal_find_task(task_name);
  if (task == nullptr) {
    return k_rx_err_not_found;
  }

  /* Update heartbeat */
  task->last_heartbeat_tick = internal_get_tick_count();
  task->timed_out           = false;

