Locked-Inc/STAR/star-rx72n-firmware/libs/rx_core/src/rx_iwdt.c
  return k_rx_ok;
}

/**
 * @brief Set the software task monitoring timeout for a specific system state
 *
 * @details
 * Configures the state-dependent software timeout used by rx_iwdt_check_tasks()
 * when the system is in the specified state. This allows different task heartbeat
 * windows depending on the operational mode (e.g. longer timeouts during
 * initialization, tighter timeouts during normal operation).
 *
 * Note: This does NOT change the hardware IWDT timeout. The hardware watchdog
 * timeout is fixed at compile/flash time via OFS registers and cannot be altered
 * at runtime. Only software task monitoring timeouts are affected.
 *
 * If state matches the currently active state (s_iwdt_state.current_state),
 * the active timeout (status.current_timeout_ms) is also updated immediately.
 *
 * Algorithm steps:
 * 1. Validate state is less than k_system_state_count
 * 2. Verify s_iwdt_state.initialized
 * 3. Validate timeout_ms is in [k_iwdt_min_timeout_ms, k_iwdt_max_timeout_ms]
 * 4. Set config.state_timeouts_ms[state] = timeout_ms
 * 5. If state == current_state, update status.current_timeout_ms
 *
 * @param[in] state System state identifier to configure (must be < k_system_state_count)
 * @param[in] timeout_ms Software task monitoring timeout in milliseconds;
 *            valid range [k_iwdt_min_timeout_ms(100), k_iwdt_max_timeout_ms(60000)]
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Timeout successfully updated
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 * @retval k_rx_err_invalid_arg state >= k_system_state_count or timeout_ms out of range
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre state must be a valid system_state_t value less than k_system_state_count
 * @post config.state_timeouts_ms[state] equals timeout_ms
 * @post If state is current, status.current_timeout_ms is updated immediately
 *
 * @note Not thread-safe; serialize state configuration changes
 * @warning Hardware IWDT timeout is unaffected; only software task monitoring changes
 *
 * @par Example:
 * @code
 * // Allow longer task timeouts during initialization phase
 * rx_iwdt_set_timeout_for_state(k_system_state_initializing, 5000);
 * rx_iwdt_set_timeout_for_state(k_system_state_running, 500);
 * @endcode
 *
 * @see rx_iwdt_set_state() Change the active system state
 * @see rx_iwdt_check_tasks() Uses current state timeout to evaluate task heartbeats
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 3 preconditions (initialized, valid state, valid timeout), 2 postconditions
 */
rx_err_t rx_iwdt_set_timeout_for_state(const system_state_t state, const uint32_t timeout_ms)
{
  /* Validate inputs */
  if (state >= k_system_state_count) {
    return k_rx_err_invalid_arg;
  }

  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  if (timeout_ms < k_iwdt_min_timeout_ms || timeout_ms > k_iwdt_max_timeout_ms) {
    return k_rx_err_invalid_arg;
  }

  /* Update state timeout */
  s_iwdt_state.config.state_timeouts_ms[state] = timeout_ms;

  /* If this is the current state, update active timeout */
  if (state == s_iwdt_state.current_state) {
    s_iwdt_state.status.current_timeout_ms = timeout_ms;
  }

  return k_rx_ok;
}

/**
 * @brief Set the current system state for software task monitoring
 *
 * @details
 * Updates the active system state used by rx_iwdt_check_tasks() to select
 * per-state task heartbeat timeout windows. Transitions between states
 * (e.g. initializing -> running) change which timeout threshold is applied
 * when evaluating task heartbeat intervals.
 *
 * This function updates three tracking fields atomically:
 * - s_iwdt_state.current_state
 * - s_iwdt_state.status.current_state
 * - s_iwdt_state.status.current_timeout_ms (set from config.state_timeouts_ms[state])
 *
 * Important: This does NOT modify the hardware IWDT peripheral. The hardware
 * watchdog timeout is a fixed constant set in OFS registers at compile time.
 * Only the software task monitoring timeout threshold changes.
 *
 * Algorithm steps:
 * 1. Validate state is less than k_system_state_count
 * 2. Verify s_iwdt_state.initialized
 * 3. Update current_state and status.current_state = state
 * 4. Update status.current_timeout_ms = config.state_timeouts_ms[state]
 *
 * @param[in] state New system state (must be < k_system_state_count)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok State successfully updated
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 * @retval k_rx_err_invalid_arg state >= k_system_state_count
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre state must be a valid system_state_t value less than k_system_state_count
 * @post s_iwdt_state.current_state reflects the new state
 * @post status.current_timeout_ms reflects the configured timeout for the new state
 *
 * @note Not thread-safe; serialize state transitions from multiple contexts
 * @warning Hardware IWDT is unaffected; only software task monitoring changes
 *
 * @par Example:
 * @code
 * // Transition from initialization to running state
 * rx_err_t err = rx_iwdt_set_state(k_system_state_running);
 * if (err != k_rx_ok) {
 *     rx_log_error("wdt", "Failed to set IWDT system state");
 * }
 * @endcode
 *
 * @see rx_iwdt_set_timeout_for_state() Configure per-state timeouts
 * @see rx_iwdt_get_status() Query current state and timeout
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 2 preconditions (initialized, valid state), 2 postconditions
 */
rx_err_t rx_iwdt_set_state(const system_state_t state)
{
  /* Validate inputs */
  if (state >= k_system_state_count) {
    return k_rx_err_invalid_arg;
  }

  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  /* Update software state tracking.
   * NOTE: This does not change the hardware watchdog timeout, as IWDT timeout
   * is configured via OFS registers at compile/flash time and cannot be changed
   * at runtime. The state-dependent timeouts are used for software task monitoring
   * via rx_iwdt_check_tasks(). The hardware IWDT timeout remains constant. */
  s_iwdt_state.current_state             = state;
  s_iwdt_state.status.current_state      = state;
  s_iwdt_state.status.current_timeout_ms = s_iwdt_state.config.state_timeouts_ms[state];

