Locked-Inc/STAR/star-rx72n-firmware/libs/rx_core/src/rx_iwdt.c
  return k_rx_ok;
}

/**
 * @brief Get a snapshot of the current IWDT module status
 *
 * @details
 * Copies the internal s_iwdt_state.status structure into the caller-provided
 * buffer via memcpy. The status snapshot includes: active task count, total
 * feed count, current system state, current timeout threshold, and the name
 * of the last task that timed out (if any).
 *
 * This is a diagnostic/telemetry function intended for logging and health
 * monitoring. The returned data is a point-in-time snapshot and may become
 * stale if the detection task or other threads update IWDT state concurrently.
 *
 * Algorithm steps:
 * 1. Validate status pointer is non-null
 * 2. Verify s_iwdt_state.initialized
 * 3. memcpy(&s_iwdt_state.status, status, sizeof(rx_iwdt_status_t))
 *
 * @param[out] status Pointer to caller-allocated rx_iwdt_status_t structure
 *             to receive the status snapshot; must be non-null; undefined on error
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Status snapshot successfully copied
 * @retval k_rx_err_null_ptr status is nullptr
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre status must be a valid non-null pointer to an rx_iwdt_status_t
 * @post *status contains a copy of s_iwdt_state.status at the time of the call
 * @post Internal IWDT state is unchanged
 *
 * @note Not thread-safe; status fields may be updated concurrently by the task monitor
 * @note Snapshot accuracy depends on timing; use as diagnostic data, not safety-critical logic
 *
 * @par Example:
 * @code
 * rx_iwdt_status_t status;
 * rx_err_t err = rx_iwdt_get_status(&status);
 * if (err == k_rx_ok) {
 *     rx_log_info("wdt", "Active tasks: %u, Feeds: %u",
 *                 (unsigned)status.active_tasks,
 *                 (unsigned)status.watchdog_feeds);
 * }
 * @endcode
 *
 * @see rx_iwdt_was_reset() Check if last reset was hardware IWDT timeout
 * @see rx_iwdt_check_tasks() Check all tasks for software timeout
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 2 preconditions (null check, initialized check), 2 postconditions
 */
rx_err_t rx_iwdt_get_status(rx_iwdt_status_t* status)
{
  /* Validate inputs */
  if (status == nullptr) {
    return k_rx_err_null_ptr;
  }

  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  /* Copy status */
  {
    const uint8_t* src = (const uint8_t*)&s_iwdt_state.status;
    uint8_t*       dst = (uint8_t*)status;
    for (size_t byte_i = 0; byte_i < sizeof(rx_iwdt_status_t); byte_i++) {
      dst[byte_i] = src[byte_i];
    }
  }

  return k_rx_ok;
}

/**
 * @brief Check whether the last microcontroller reset was caused by an IWDT timeout
 *
 * @details
 * Reads the IWDT Reset Flag (IWDTRF) from the Reset Status Register 2 (RSTSR2)
 * of the RX72N. This register is located at a separate address from RSTSR0/1
 * and retains the reset cause flags across a reset event (values are cleared
 * on power-on reset only).
 *
 * The IWDTRF bit (bit position k_rstsr2_iwdtrf) is set by hardware when the IWDT
 * counter underflows (i.e., the watchdog was not refreshed in time). It remains
 * set until explicitly cleared or a power-on reset occurs.
 *
 * This function is used during startup to detect and log prior watchdog resets,
 * which may indicate a firmware hang or task scheduling failure.
 *
 * Algorithm steps:
 * 1. Read the RSTSR2 register byte via rstsr2() inline accessor
 * 2. Mask with k_rstsr2_iwdtrf to extract the IWDT reset flag bit
 * 3. Return true if the bit is set, false otherwise
 *
 * @return bool IWDT reset detection result
 * @retval true  RSTSR2.IWDTRF is set; last reset was caused by IWDT timeout
 * @retval false RSTSR2.IWDTRF is clear; last reset was not caused by IWDT
 *
 * @pre None -- safe to call before rx_iwdt_init() (reads hardware register directly)
 * @pre Must be called before the application clears the reset status register
 * @post Hardware RSTSR2 register is read-only; this function does not modify it
 * @post Return value reflects hardware register state at the instant of the call
 *
 * @note Thread-safe -- reads a single hardware register without shared state
 * @note Typically called once at startup to log the reset cause
 * @warning RSTSR2.IWDTRF remains set across warm resets; clear it in startup if needed
 *
 * @par Example:
 * @code
 * if (rx_iwdt_was_reset()) {
 *     rx_log_error("boot", "Prior reset caused by IWDT timeout - check task health");
 * }
 * rx_iwdt_init(&iwdt_config);
 * @endcode
 *
 * @see rx_iwdt_feed() Feed the hardware watchdog to prevent reset
 * @see rx_iwdt_check_tasks() Monitor software task heartbeats
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 2 preconditions (safe before init, called before register clear), 2 postconditions
 */
bool rx_iwdt_was_reset(void)
{
  /* Read reset status register 2 for IWDT reset flag
   * Note: RSTSR2 is at a separate address from RSTSR0/1 */
  volatile uint8_t* const rstsr2_reg = rstsr2();
  const uint8_t           status     = *rstsr2_reg;

  /* Check IWDT reset flag in RSTSR2 */
  return (bool)((status & k_rstsr2_iwdtrf) != 0);
}

/**
 * @brief Check all registered tasks for software heartbeat timeout
 *
 * @details
 * Iterates over all active task slots and compares the elapsed tick count
 * since each task's last heartbeat against that task's configured timeout
 * (converted from milliseconds to ThreadX ticks). If any task has exceeded
 * its timeout, the task's timed_out flag is set, the task name is recorded
 * in status.last_failed_task, and the function returns k_rx_err_timeout.
 *
 * If task monitoring is disabled (config.enable_task_monitoring == false),
 * returns k_rx_ok immediately without checking any tasks.
 *
 * The caller (typically the watchdog task) should conditionally feed the
 * hardware IWDT only if this function returns k_rx_ok -- i.e., only refresh
 * the hardware watchdog when all software tasks are alive.
 *
 * Algorithm steps:
 * 1. Verify s_iwdt_state.initialized
 * 2. If !config.enable_task_monitoring, return k_rx_ok early
 * 3. Capture current_tick = internal_get_tick_count()
 * 4. For each active task slot (i < k_iwdt_max_tasks):
 *    a. Skip inactive slots
 *    b. Compute elapsed_ticks = current_tick - task->last_heartbeat_tick
 *    c. Compute timeout_in_ticks from task->timeout_ms and TX_TIMER_TICKS_PER_SECOND
 *    d. If elapsed_ticks > timeout_in_ticks: set timed_out=true, record task name, set any_timeout=true
 * 5. Return k_rx_err_timeout if any_timeout, else k_rx_ok
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All active tasks are within their heartbeat timeout windows
 * @retval k_rx_err_timeout One or more registered tasks have exceeded their timeout;
 *         name of first failing task is recorded in status.last_failed_task
 * @retval k_rx_err_not_initialized rx_iwdt_init() has not been called
 *
 * @pre rx_iwdt_init() must have been called successfully
 * @pre Registered tasks must be calling rx_iwdt_task_heartbeat() on schedule
 * @post Timed-out tasks have their timed_out flag set
 * @post status.last_failed_task contains the name of the most recently detected failure
 *
 * @note Not thread-safe; task heartbeat fields may be updated concurrently
 * @warning Do NOT feed the hardware IWDT (rx_iwdt_feed()) if this returns k_rx_err_timeout;
 *          allow the hardware watchdog to fire and reset the system
 *
 * @par Example:
 * @code
 * // Watchdog task main loop
 * while (1) {
 *     if (rx_iwdt_check_tasks() == k_rx_ok) {
 *         rx_iwdt_feed();  // Only feed if all tasks are alive
 *     } else {
 *         rx_log_error("wdt", "Task timeout detected -- allowing IWDT reset");
 *         // Do NOT feed the watchdog -- let hardware reset occur
 *     }
 *     tx_thread_sleep(k_watchdog_check_interval_ticks);
 * }
 * @endcode
 *
 * @see rx_iwdt_feed() Feed hardware watchdog (call only when this returns k_rx_ok)
 * @see rx_iwdt_task_heartbeat() Update per-task heartbeat from each monitored task
 * @see rx_iwdt_register_task() Register a task for monitoring
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: 2 preconditions (initialized, tasks registered), 2 postconditions
 */
rx_err_t rx_iwdt_check_tasks(void)
{
  if (!s_iwdt_state.initialized) {
    return k_rx_err_not_initialized;
  }

  if (!s_iwdt_state.config.enable_task_monitoring) {
    return k_rx_ok;
  }

  const uint32_t current_tick = internal_get_tick_count();
  bool           any_timeout  = false;

  /* Check each registered task */
  for (uint32_t i = 0; i < k_iwdt_max_tasks; i++) {
    if (!s_iwdt_state.tasks[i].active) {
      continue;
    }

    /* Calculate elapsed time */
    const uint32_t elapsed_ticks = current_tick - s_iwdt_state.tasks[i].last_heartbeat_tick;
    const uint32_t timeout_in_ticks =
      (s_iwdt_state.tasks[i].timeout_ms * TX_TIMER_TICKS_PER_SECOND) / k_ms_per_second;

    /* Check for timeout */
    if (elapsed_ticks > timeout_in_ticks) {
      s_iwdt_state.tasks[i].timed_out = true;
      any_timeout                     = true;

      /* Record failed task */
      internal_safe_strcpy(s_iwdt_state.status.last_failed_task,
                           s_iwdt_state.tasks[i].task_name,
                           k_iwdt_task_name_len);
    }
  }

  return (int)any_timeout ? k_rx_err_timeout : k_rx_ok;
}
